#include <stdio.h>

// функція для обчислення найбільшого спільного дільника двох чисел
int gcd(int a, int b) {
    while (b != 0) {
        int temp = a % b;
        a = b;
        b = temp;
    }
    return a;
}

// функція для обчислення найменшого спільного кратного двох чисел
int lcm(int a, int b) {
    return (a / gcd(a, b)) * b;
}

int main() {
    int n; // кількість чисел
    scanf("%d", &n);
    int result; // змінна для зберігання результату
    scanf("%d", &result); // зчитування першого числа
    for (int i = 1; i < n; i++) {
        int a; // змінна для зберігання наступного числа
        scanf("%d", &a);
        result = lcm(result, a); // обчислення найменшого спільного кратного для поточного результату та наступного числа
    }
    printf("%d\n", result); // виведення результату
    return 0;
}
